In [ ]:
#pip installs, run these the first time. Then you shouldn't need to run them after.
!pip3 install ipython-sql --user
!pip3 install mysql-connector --user
!pip3 install mysql --user

In [51]:
#get all the data into a dictionary and a list
#Starting the database connection and setting up connection values
import mysql
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="nsangani",
  passwd="nsangani",
  database="nsangani_db"
)

#create a new 'cursor' object to run commands
mycursor = mydb.cursor(buffered=True)

In [2]:
#execute SQL commands using the cursor
mycursor.execute("CREATE TABLE persons (id int PRIMARY KEY AUTO_INCREMENT,last_name varchar(255),first_name varchar(255),age int,city varchar(255));")
print(mycursor)

MySQLCursorBuffered: CREATE TABLE persons (id int PRIMARY KEY..

In [9]:
#use execute many, which will take a command
#and then a list of values to pass.

sql = "insert into persons (last_name,first_name,age,city) VALUES (%s, %s, %s, %s);"
val = [
  ('Planck','Max',73,'Kiel'),
  ('Schrodinger','Erwin',73,'Vienna'),
  ('Feynman','Richard',69,'New York'),
  ('Oppenheimer','Robert',62,'New York')
]

mycursor.executemany(sql, val)
mydb.commit()

In [24]:
#lets run some select statements, starting with selecting everything
mycursor.execute("SELECT * FROM persons;")
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Boston')
(2, 'Schrodinger', 'Erwin', 73, 'Vienna')
(3, 'Feynman', 'Richard', 69, 'New York')
(4, 'Oppenheimer', 'Robert', 62, 'New York')
(5, 'Planck', 'Max', 73, 'Kiel')
(6, 'Schrodinger', 'Erwin', 73, 'Vienna')
(7, 'Feynman', 'Richard', 69, 'New York')
(8, 'Oppenheimer', 'Robert', 62, 'New York')

In [11]:
#Now just last and first name
mycursor.execute("SELECT last_name, first_name FROM persons;")
records = mycursor.fetchall()
for x in records:
  print(x)

('Planck', 'Max')
('Schrodinger', 'Erwin')
('Feynman', 'Richard')
('Oppenheimer', 'Robert')
('Planck', 'Max')
('Schrodinger', 'Erwin')
('Feynman', 'Richard')
('Oppenheimer', 'Robert')

In [12]:
#Now just last and first name where the age is greater than 69
mycursor.execute("SELECT last_name, first_name FROM persons WHERE age > 69;")
records = mycursor.fetchall()
for x in records:
  print(x)

('Planck', 'Max')
('Schrodinger', 'Erwin')
('Planck', 'Max')
('Schrodinger', 'Erwin')

In [13]:
#Now just the ages
mycursor.execute("SELECT age FROM persons;")
records = mycursor.fetchall()
for x in records:
  print(x)

(73,)
(73,)
(69,)
(62,)
(73,)
(73,)
(69,)
(62,)

In [14]:
#Now just the unique ages
mycursor.execute("SELECT DISTINCT(age) FROM persons;")
records = mycursor.fetchall()
for x in records:
  print(x)

(73,)
(69,)
(62,)

In [15]:
#Now where last_name is Planck and first name starts with M
mycursor.execute('SELECT * FROM persons WHERE last_name ="Planck" and first_name like "M%";')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Kiel')
(5, 'Planck', 'Max', 73, 'Kiel')

In [16]:
#Now where first starts with M or last is Schrodinger
mycursor.execute('SELECT * FROM persons WHERE first_name like "M%" OR last_name="Schrodinger";')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Kiel')
(2, 'Schrodinger', 'Erwin', 73, 'Vienna')
(5, 'Planck', 'Max', 73, 'Kiel')
(6, 'Schrodinger', 'Erwin', 73, 'Vienna')

In [22]:
#Now everyone whose name doesn't start with M
mycursor.execute('SELECT * FROM persons WHERE NOT first_name like "M%";')
records = mycursor.fetchall()
for x in records:
  print(x)

(2, 'Schrodinger', 'Erwin', 73, 'Vienna')
(3, 'Feynman', 'Richard', 69, 'New York')
(4, 'Oppenheimer', 'Robert', 62, 'New York')
(6, 'Schrodinger', 'Erwin', 73, 'Vienna')
(7, 'Feynman', 'Richard', 69, 'New York')
(8, 'Oppenheimer', 'Robert', 62, 'New York')

In [25]:
#Let's update the person with id = 1 city to Boston
mycursor.execute('UPDATE persons SET city="Boston" WHERE id = 1;')

mycursor.execute('SELECT * FROM persons WHERE id = 1;')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Indy')

In [26]:
#Let's update the person with first name Max to Kiel
mycursor.execute('UPDATE persons SET city="Kiel" WHERE first_name = "Max";')

mycursor.execute('SELECT * FROM persons;')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Kiel')
(2, 'Schrodinger', 'Erwin', 73, 'Vienna')
(3, 'Feynman', 'Richard', 69, 'New York')
(4, 'Oppenheimer', 'Robert', 62, 'New York')
(5, 'Planck', 'Max', 73, 'Kiel')
(6, 'Schrodinger', 'Erwin', 73, 'Vienna')
(7, 'Feynman', 'Richard', 69, 'New York')
(8, 'Oppenheimer', 'Robert', 62, 'New York')

In [27]:
#Let's update everyone who lives in New York to San Francisco
mycursor.execute('UPDATE persons SET city="San Francisco" WHERE city = "New York";')

mycursor.execute('SELECT * FROM persons;')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Kiel')
(2, 'Schrodinger', 'Erwin', 73, 'Vienna')
(3, 'Feynman', 'Richard', 69, 'San Francisco')
(4, 'Oppenheimer', 'Robert', 62, 'San Francisco')
(5, 'Planck', 'Max', 73, 'Kiel')
(6, 'Schrodinger', 'Erwin', 73, 'Vienna')
(7, 'Feynman', 'Richard', 69, 'San Francisco')
(8, 'Oppenheimer', 'Robert', 62, 'San Francisco')

In [28]:
#now lets try deleting data where the age > 69
mycursor.execute('DELETE FROM persons WHERE age > 69;')

mycursor.execute('SELECT * FROM persons;')
records = mycursor.fetchall()
for x in records:
  print(x)

(3, 'Feynman', 'Richard', 69, 'San Francisco')
(4, 'Oppenheimer', 'Robert', 62, 'San Francisco')
(7, 'Feynman', 'Richard', 69, 'San Francisco')
(8, 'Oppenheimer', 'Robert', 62, 'San Francisco')

In [29]:
#now lets try deleting all data
mycursor.execute('DELETE FROM persons;')

mycursor.execute('SELECT * FROM persons;')
records = mycursor.fetchall()
for x in records:
  print(x)

In [30]:
#Let's put the data back

sql = "insert into persons (last_name,first_name,age,city) VALUES (%s, %s, %s, %s);"
val = [
  ('Planck','Max',73,'Kiel'),
  ('Schrodinger','Erwin',73,'Vienna'),
  ('Feynman','Richard',69,'New York'),
  ('Oppenheimer','Robert',62,'New York')
]

mycursor.executemany(sql, val)

mydb.commit()
mycursor.execute('SELECT * FROM persons;')
records = mycursor.fetchall()
for x in records:
  print(x)

(9, 'Planck', 'Max', 73, 'Kiel')
(10, 'Schrodinger', 'Erwin', 73, 'Vienna')
(11, 'Feynman', 'Richard', 69, 'New York')
(12, 'Oppenheimer', 'Robert', 62, 'New York')

In [31]:
#note that the ID's are not reset
#lets fix that with truncate

mycursor.execute('TRUNCATE TABLE persons;')

sql = "insert into persons (last_name,first_name,age,city) VALUES (%s, %s, %s, %s);"
val = [
  ('Planck','Max',73,'Kiel'),
  ('Schrodinger','Erwin',73,'Vienna'),
  ('Feynman','Richard',69,'New York'),
  ('Oppenheimer','Robert',62,'New York')
]

mycursor.executemany(sql, val)
mydb.commit()

mycursor.execute('SELECT * FROM persons;')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, 'Kiel')
(2, 'Schrodinger', 'Erwin', 73, 'Vienna')
(3, 'Feynman', 'Richard', 69, 'New York')
(4, 'Oppenheimer', 'Robert', 62, 'New York')

In [32]:
#let's alter our table to increase it's value

#let's start by altering the name to be scientists
mycursor.execute('ALTER TABLE persons RENAME TO scientists;')
#PS. If you go back and execute prior code the table is now renamed

#then we'll add another column, specialty
#remember to use the new table name
mycursor.execute('ALTER TABLE scientists ADD specialty VARCHAR(255);')

#science doesn't care about the city
#yeet it on out of here
mycursor.execute('ALTER TABLE scientists DROP COLUMN city;')

In [34]:
#lets take a look at our altered table
mycursor.execute('SELECT * FROM scientists;')
records = mycursor.fetchall()
for x in records:
  print(x)

(1, 'Planck', 'Max', 73, None)
(2, 'Schrodinger', 'Erwin', 73, None)
(3, 'Feynman', 'Richard', 69, None)
(4, 'Oppenheimer', 'Robert', 62, None)

In [35]:
#enough of scientists. Let's look at foreign key relationships
#execute SQL commands using the cursor
mycursor.execute("""CREATE TABLE customers (
customer_id INT NOT NULL, 
first_name VARCHAR(50) NOT NULL, 
last_name VARCHAR(50) NOT NULL, 
address VARCHAR(255) NOT NULL, 
age INT NOT NULL,
PRIMARY KEY (customer_id));""")
print(mycursor)

#now create the purchase table that references customers
mycursor.execute("""CREATE TABLE purchases ( 
purchase_id INT NOT NULL PRIMARY KEY, 
customer_id INT NOT NULL REFERENCES customers(customer_id), 
date DATE NOT NULL , 
cost FLOAT NOT NULL);""")
print(mycursor)

MySQLCursorBuffered: CREATE TABLE customers (
customer_id INT..
MySQLCursorBuffered: CREATE TABLE purchases (
purchase_id IN..

In [36]:
#you can't insert into the child table first
#Let's create a customer
mycursor.execute('INSERT INTO customers (customer_id, first_name, last_name, address, age) VALUES ("2", "John", "Burns", "Somewhere, USA", "37");')
mydb.commit()

#now add a purchase
mycursor.execute('INSERT INTO purchases (purchase_id, customer_id, date, cost) VALUES ("110", "2", "2019-09-07", "12.00");')
mydb.commit()

#take a look at the database to see how these look

In [37]:
#now let's create our own grading system
#consisting of students, courses, and grades
mycursor.execute("""CREATE TABLE student(
id CHAR(4) NOT NULL PRIMARY KEY,
first VARCHAR(255) NOT NULL, 
last VARCHAR(255) NOT NULL);""")

mycursor.execute("""CREATE TABLE course(
code CHAR(3) NOT NULL PRIMARY KEY,  
title VARCHAR(255) NOT NULL);""")

mycursor.execute("""CREATE TABLE grade(
id CHAR(4) NOT NULL REFERENCES student(id),  
code CHAR(3) NOT NULL REFERENCES course(code),  
marks INT(11) NOT NULL);""")

#now I'm making a fundemental mistake here
#I've not properly named my ID's so it gets confusing, and I haven't given
#the grades table it's own unique ID.
#this could be a serious problem if a student has to retake a class.

#but were going to forgive some of that for brevity.

In [38]:
#lets insert lots of data
#first the students
sql_student = "insert into student (id, first, last) VALUES (%s, %s, %s);"
val_student = [
    ("S103","John","Smith"),
    ("S104","Mary","Jones"),
    ("S105","Jane","Brown"),
    ("S106","Mark","Jones"),
    ("S107","John","Brown")
]

sql_course = "insert into course (code, title) VALUES (%s, %s);"
val_course = [
    ("DBS","Database Systems"),
    ("PR1","Programming 1"),
    ("PR2","Programming 2"),
    ("IAI","Intro to AI")
]

sql_grade = "insert into grade (id, code, marks) VALUES (%s, %s, %s);"
val_grade = [
    ("S103","DBS",72),
    ("S103","IAI",58),
    ("S104","PR1",68),
    ("S104","IAI",65),
    ("S106","PR2",43),
    ("S107","PR1",76),
    ("S107","PR2",60),
    ("S107","IAI",35)
]


mycursor.executemany(sql_student, val_student)
mycursor.executemany(sql_course, val_course)
mycursor.executemany(sql_grade, val_grade)

In [39]:
mydb.commit()

In [40]:
#cross product
mycursor.execute('SELECT * FROM student,grade;')
records = mycursor.fetchall()
for x in records:
  print(x)

('S103', 'John', 'Smith', 'S103', 'DBS', 72)
('S104', 'Mary', 'Jones', 'S103', 'DBS', 72)
('S105', 'Jane', 'Brown', 'S103', 'DBS', 72)
('S106', 'Mark', 'Jones', 'S103', 'DBS', 72)
('S107', 'John', 'Brown', 'S103', 'DBS', 72)
('S103', 'John', 'Smith', 'S103', 'IAI', 58)
('S104', 'Mary', 'Jones', 'S103', 'IAI', 58)
('S105', 'Jane', 'Brown', 'S103', 'IAI', 58)
('S106', 'Mark', 'Jones', 'S103', 'IAI', 58)
('S107', 'John', 'Brown', 'S103', 'IAI', 58)
('S103', 'John', 'Smith', 'S104', 'PR1', 68)
('S104', 'Mary', 'Jones', 'S104', 'PR1', 68)
('S105', 'Jane', 'Brown', 'S104', 'PR1', 68)
('S106', 'Mark', 'Jones', 'S104', 'PR1', 68)
('S107', 'John', 'Brown', 'S104', 'PR1', 68)
('S103', 'John', 'Smith', 'S104', 'IAI', 65)
('S104', 'Mary', 'Jones', 'S104', 'IAI', 65)
('S105', 'Jane', 'Brown', 'S104', 'IAI', 65)
('S106', 'Mark', 'Jones', 'S104', 'IAI', 65)
('S107', 'John', 'Brown', 'S104', 'IAI', 65)
('S103', 'John', 'Smith', 'S106', 'PR2', 43)
('S104', 'Mary', 'Jones', 'S106', 'PR2', 43)
('S105', 'Jane', 'Brown', 'S106', 'PR2', 43)
('S106', 'Mark', 'Jones', 'S106', 'PR2', 43)
('S107', 'John', 'Brown', 'S106', 'PR2', 43)
('S103', 'John', 'Smith', 'S107', 'PR1', 76)
('S104', 'Mary', 'Jones', 'S107', 'PR1', 76)
('S105', 'Jane', 'Brown', 'S107', 'PR1', 76)
('S106', 'Mark', 'Jones', 'S107', 'PR1', 76)
('S107', 'John', 'Brown', 'S107', 'PR1', 76)
('S103', 'John', 'Smith', 'S107', 'PR2', 60)
('S104', 'Mary', 'Jones', 'S107', 'PR2', 60)
('S105', 'Jane', 'Brown', 'S107', 'PR2', 60)
('S106', 'Mark', 'Jones', 'S107', 'PR2', 60)
('S107', 'John', 'Brown', 'S107', 'PR2', 60)
('S103', 'John', 'Smith', 'S107', 'IAI', 35)
('S104', 'Mary', 'Jones', 'S107', 'IAI', 35)
('S105', 'Jane', 'Brown', 'S107', 'IAI', 35)
('S106', 'Mark', 'Jones', 'S107', 'IAI', 35)
('S107', 'John', 'Brown', 'S107', 'IAI', 35)

In [41]:
#a more rational select
mycursor.execute('SELECT * FROM student,grade where (student.id = grade.id);')
records = mycursor.fetchall()
for x in records:
  print(x)

#note that python uses ==
#and mysql uses =
#for comparisons

('S103', 'John', 'Smith', 'S103', 'DBS', 72)
('S103', 'John', 'Smith', 'S103', 'IAI', 58)
('S104', 'Mary', 'Jones', 'S104', 'PR1', 68)
('S104', 'Mary', 'Jones', 'S104', 'IAI', 65)
('S106', 'Mark', 'Jones', 'S106', 'PR2', 43)
('S107', 'John', 'Brown', 'S107', 'PR1', 76)
('S107', 'John', 'Brown', 'S107', 'PR2', 60)
('S107', 'John', 'Brown', 'S107', 'IAI', 35)

In [42]:
#we can add additional constraints as appropriate.
mycursor.execute('SELECT * FROM student,grade where (student.id = grade.id) and marks >= 40;')
records = mycursor.fetchall()
for x in records:
  print(x)

('S103', 'John', 'Smith', 'S103', 'DBS', 72)
('S103', 'John', 'Smith', 'S103', 'IAI', 58)
('S104', 'Mary', 'Jones', 'S104', 'PR1', 68)
('S104', 'Mary', 'Jones', 'S104', 'IAI', 65)
('S106', 'Mark', 'Jones', 'S106', 'PR2', 43)
('S107', 'John', 'Brown', 'S107', 'PR1', 76)
('S107', 'John', 'Brown', 'S107', 'PR2', 60)

In [43]:
#And constrain the columns that come back
mycursor.execute('SELECT first, last, marks FROM student,grade where (student.id = grade.id) and marks >= 40;')
records = mycursor.fetchall()
for x in records:
  print(x)

('John', 'Smith', 72)
('John', 'Smith', 58)
('Mary', 'Jones', 68)
('Mary', 'Jones', 65)
('Mark', 'Jones', 43)
('John', 'Brown', 76)
('John', 'Brown', 60)

In [52]:
#Now lets get all 3 tables
mycursor.execute('SELECT marks, first, last, title FROM course, student, grade where student.id = grade.id and course.code = grade.code;')
records = mycursor.fetchall()
for x in records:
  print(x)

(72, 'John', 'Smith', 'Database Systems')
(58, 'John', 'Smith', 'Intro to AI')
(65, 'Mary', 'Jones', 'Intro to AI')
(35, 'John', 'Brown', 'Intro to AI')
(68, 'Mary', 'Jones', 'Programming 1')
(76, 'John', 'Brown', 'Programming 1')
(43, 'Mark', 'Jones', 'Programming 2')
(60, 'John', 'Brown', 'Programming 2')

In [53]:
mydb.close()